{
  "backend/main.mo": "Defines the main actor with authorization and storage mixins and declares extensive ERP-related types for organizations, commerce, CRM, HRMS, and tasks.",
  "backend/migration.mo": "Provides a module containing duplicated ERP type definitions used for migration logic to maintain data compatibility.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no features listed.",
  "frontend-file-summaries.txt": "Lists textual summaries of various frontend files including pages, components, hooks, and context providers.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-driven color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up router, global providers, authentication gating, and conditional modals for profile and Stripe setup.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin UI to add, edit, and delete product categories using a dialog-driven form.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin table for viewing orders and updating their status via a dropdown selector.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "UI for listing organizations and creating new ones with a form and dialog, using query hooks and optimistic creation logic.",
  "frontend/src/components/admin/ProductManagement.tsx": "Product CRUD interface with form dialog, category selection, and integration with product query/mutation hooks.",
  "frontend/src/components/crm/ContactManagement.tsx": "Contact CRUD UI that loads contacts, supports add/edit/delete, and ties created records to the current Internet Identity user.",
  "frontend/src/components/crm/LeadManagement.tsx": "Lead management interface enabling creation, editing, and deletion of leads, including stage handling and revenue fields.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Opportunity CRUD component allowing editing of value, probability, stage, and notes, linked to the authenticated user.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Renders a sales pipeline dashboard with stage counts, progress bars, and summary stats using pipeline and lead data queries.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding, GitHub link, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Header with auth controls, navigation, organization switcher, admin links, and cart indicator.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Displays a placeholder card indicating attendance tracking features are coming soon.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides CRUD management for departments with dialogs, forms, and table listings backed by department query hooks.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Implements employee CRUD operations with forms, dialogs, and status handling, using HR dashboard and department queries.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Shows pending leave requests with approve/reject actions and a table layout backed by leave management queries.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Displays a placeholder card for upcoming payroll processing functionality.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Shows a placeholder card for future employee performance tracking features.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown component that lets users view and switch between organizations from context.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter their name and submit a profile creation request.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for entering Stripe credentials and allowed countries to configure payments.",
  "frontend/src/components/WalletManagement.tsx": "Interface for listing, adding, and deleting user wallets with dialog-based creation.",
  "frontend/src/components/WalletSummary.tsx": "Displays user's wallet balances and recent transactions, with auto-refresh and status indicators.",
  "frontend/src/contexts/CartContext.tsx": "Defines a cart context storing items in localStorage with add, remove, update, and total calculation utilities.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization state with persistence, mock organization fetching, and identity-dependent hydration.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Provides React context for managing wallet connectors, tracking availability, selection, connection state, and errors. Handles auto-selection, connection flow, and state updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing access control and invalidating queries when identity changes. Returns the active actor and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login, stored identities, and status tracking using Dfinity AuthClient. Loads identities on mount and exposes login and clear functions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, organizations, and ERP-related data using the backend actor. Some organization and ERP methods are placeholders awaiting backend support.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from the WalletConnectorContext.",
  "frontend/src/index.css": "Tailwind CSS setup defining base theme variables for light and dark modes, including color tokens and layout properties.",
  "frontend/src/main.tsx": "Application entry point that initializes React Query and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard displaying analytics, revenue, orders, and management components, with access control and loading states.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page handling item updates and checkout via Stripe or ICP with wallet integration.",
  "frontend/src/pages/CrmDashboard.tsx": "Admin-only CRM dashboard showing stats and management tabs for contacts, leads, opportunities, and pipeline.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin-only HRMS dashboard providing overview metrics and management tabs for employees, departments, attendance, leaves, payroll, and performance.",
  "frontend/src/pages/OrdersPage.tsx": "Displays user's orders with status, details, and cancellation option, including loading and empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and shows a success message with navigation to orders or home.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog with search, category filtering, product listing, and add-to-cart functionality.",
  "frontend/src/types/erp-types.ts": "Defines placeholder ERP domain types for products, orders, CRM, HR, and payroll until backend APIs are finalized.",
  "frontend/src/utils/formatIdentity.ts": "Provides a helper to truncate long identity strings for display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements the Oisy wallet connector, handling availability checks, connect/disconnect, and identity retrieval.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements the Plug wallet connector with connect flow, identity retrieval, and connection state checks.",
  "frontend/src/wallets/inpageProviders.d.ts": "Declares TypeScript types for in-page Plug and Oisy wallet providers on window.ic.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and provides lookup utilities by connector ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines shared wallet connector interfaces, provider IDs, and identity info types.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project metadata, versioning, feature inventory, and the current state of the UniversalERP system."
}