{
  "backend/main.mo": "Defines core ERP types for organizations, CRM, HRMS, ecommerce, and includes authorization and storage mixins.",
  "backend/migration.mo": "Implements wallet-related legacy-to-new state migration by returning the same maps unchanged.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference.",
  "frontend/index.css": "Tailwind base theme configuration defining light and dark mode variables and global styles.",
  "frontend/index.html": "HTML entrypoint hosting the root div and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app wiring routes, providers, authentication, profile setup, Stripe setup, and layout structure.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin UI for listing, adding, editing, and deleting product categories using dialogs and API mutations.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin table showing orders with status badges and a selector to update order status via API.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "UI for listing organizations and creating new ones with form handling and loading states.",
  "frontend/src/components/admin/ProductManagement.tsx": "Provides product CRUD management with dialogs, form handling, and category integration.",
  "frontend/src/components/crm/ContactManagement.tsx": "Manages contact CRUD operations with identity-based ownership and modal form UI.",
  "frontend/src/components/crm/LeadManagement.tsx": "Handles lead creation, editing, and deletion with stage management and linked contacts.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Implements opportunity CRUD workflows with value, stage, probability, and notes handling.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays a sales pipeline overview using pipeline and lead data, including stage counts, progress bars, and summary metrics.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding, GitHub link, and styling.",
  "frontend/src/components/Header.tsx": "Header with auth controls, organization switcher, navigation links, and cart indicator.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder component showing a card for attendance tracking with coming-soon messaging.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides full CRUD UI for departments using dialogs, tables, and react-query mutations.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Manages employee records with add, edit, delete dialogs and department/status selection, using react-query mutations.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Lists pending leave requests with approve/reject actions and loading states.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder payroll management card indicating future payroll processing features.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder component for employee performance tracking with coming-soon messaging.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown component allowing users to switch between organizations with active selection display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and submits it via saveProfile, showing success or error toasts.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal that configures Stripe by submitting a secret key and allowed countries when Stripe is not yet set up.",
  "frontend/src/components/WalletManagement.tsx": "Interface for listing, adding, and deleting wallets, including form inputs, status handling, and API mutations.",
  "frontend/src/components/WalletSummary.tsx": "Displays user's wallet balances and recent transactions with auto-refresh and status/type formatting.",
  "frontend/src/contexts/CartContext.tsx": "Provides a cart context with item storage, quantity management, totals, and localStorage persistence.",
  "frontend/src/contexts/OrganizationContext.tsx": "Maintains active organization state, loads organizations via react-query, syncs with localStorage, and handles identity changes.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Provides context and state management for selecting, connecting, and tracking wallet connector availability and identity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, state, and login flow using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, organizations, CRM, and ERP-related data using the backend actor.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from the context.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for UI styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard UI showing analytics, access control, and management components for products, categories, orders, and wallets.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management and Stripe or ICP wallet checkout flow.",
  "frontend/src/pages/CrmDashboard.tsx": "Admin-only CRM dashboard showing stats and navigation to contact, lead, opportunity, and pipeline management.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin-only HRMS dashboard with employee, department, attendance, leave, payroll, performance, and wallet management tabs.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's orders with status, details, and cancellation options.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with navigation options back to cart or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and shows a success message with links to orders or shopping.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog with search, category filtering, and add-to-cart functionality.",
  "frontend/src/types/erp-types.ts": "Defines placeholder ERP domain types for products, CRM, HR, payroll, analytics, and related IDs mirroring backend structures.",
  "frontend/src/utils/formatIdentity.ts": "Utility to shorten identity strings by truncating the middle for display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements the Oisy wallet connector with availability checks, connect/disconnect, and connection state retrieval.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements the Plug wallet connector including connect flow, account retrieval, and connection state checks.",
  "frontend/src/wallets/inpageProviders.d.ts": "Type declarations for in-page Plug and Oisy wallet providers added to the global window object.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and exposes lookup utilities by provider ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines shared wallet connector interfaces, provider IDs, and identity info types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling custom colors, themes, animations, and plugins.",
  "project_state.json": "Metadata describing project version, implemented features, and current multi-organization progress."
}