{
  "backend/main.mo": "Defines the actor and all ERP data types including organizations, CRM, HRMS, products, orders, and storage mixins.",
  "backend/migration.mo": "Contains a migration module that passes through existing organization data unchanged.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles with OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, providers, authentication handling, and global modals for the React app.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin UI to create, edit, and delete categories using a dialog form and mutation hooks.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin table showing all orders with editable statuses and formatted order details.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "UI for listing organizations, creating new ones via dialog, and showing members using query hooks.",
  "frontend/src/components/admin/ProductManagement.tsx": "Product CRUD interface with dialog-based add/edit, category selection, and delete actions using query hooks.",
  "frontend/src/components/crm/ContactManagement.tsx": "Manages contacts with add/edit/delete dialogs, identity-based ownership, and table display.",
  "frontend/src/components/crm/LeadManagement.tsx": "Handles lead CRUD with stages, contact association, revenue fields, and identity-based ownership.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Provides opportunity CRUD with value, probability, stage selection, notes, and identity-linked ownership.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays sales pipeline metrics by stage using query data and renders progress bars and summary stats.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, caffeine.ai link, and GitHub icon.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication controls, org switcher, admin links, and cart indicator.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Static placeholder card indicating attendance tracking will be added later.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides CRUD UI for departments with dialogs, forms, and table listings using query mutations.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Handles employee creation, editing, and deletion with form dialogs and status badges tied to HR dashboard data.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Shows pending leave requests and allows approving or rejecting them with mutation calls.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder card indicating payroll processing functionality is upcoming.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder component for future employee performance tracking features.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown component allowing authenticated users to switch between organizations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter their name and submit a profile creation request via a mutation.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe by submitting a secret key and allowed countries.",
  "frontend/src/components/WalletManagement.tsx": "Interface for listing, adding, and deleting wallets with dialogs, validations, and backend mutations.",
  "frontend/src/components/WalletSummary.tsx": "Displays user wallet balances and recent transactions with auto-refresh and status badges.",
  "frontend/src/contexts/CartContext.tsx": "Implements a shopping cart context with persistent storage, quantity updates, totals, and item management.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization selection, persistence, and loading user organizations via query hooks.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Provides React context for managing wallet connector selection, availability checks, and connect/disconnect workflow.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls using React Query for user profiles, organizations, and other ERP-related data operations.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from the context module.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark theming and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with analytics, management tabs, and access control checks.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management, Stripe or ICP checkout flows, and wallet connection handling.",
  "frontend/src/pages/CrmDashboard.tsx": "Renders the admin-only CRM dashboard with stats, tabs, and management components for contacts, leads, and opportunities.",
  "frontend/src/pages/HrmsDashboard.tsx": "Provides an admin-only HRMS dashboard with tabs for employees, departments, attendance, payroll, and performance data.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's order history with status badges and cancellation support.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message after unsuccessful payment with navigation options back to cart or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and displays a success confirmation with links to orders or continued shopping.",
  "frontend/src/pages/StorefrontPage.tsx": "Lists products with search and category filtering, showing stock status and allowing items to be added to the cart.",
  "frontend/src/types/erp-types.ts": "Defines placeholder ERP domain types for products, orders, CRM, HR, and payroll until backend interfaces are finalized.",
  "frontend/src/utils/formatIdentity.ts": "Utility to truncate and format identity strings for display.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters, persist them in sessionStorage, and manage hash-based routing params.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements a wallet connector for Oisy, handling availability checks, connect/disconnect, and connection state.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements a wallet connector for Plug, including connection flow, identity retrieval, and disconnect handling.",
  "frontend/src/wallets/inpageProviders.d.ts": "Ambient TypeScript definitions for Plug and Oisy inpage wallet providers on window.ic.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and provides lookup helpers by provider ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines wallet connector interfaces, provider IDs, and connected identity types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes the project’s current state, features, and roadmap for multi-tenant ERP and wallet integration."
}