{
  "backend/main.mo": "Motoko canister defining core ERP domain types (organizations, ecommerce, CRM, HRMS) and including authorization and blob storage mixins, with Stripe and HTTP outcall integrations planned.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no recorded features.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files, used as documentation or planning reference rather than executable code.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark themes, and base styles using OKLCH color variables.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the Vite main.tsx module.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes, global providers (theme, cart, organization, wallet), authentication handling, and setup modals.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin interface for creating, editing, and deleting product categories. Uses dialogs and a table backed by category query and mutation hooks with toast feedback.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin dashboard for viewing all orders and updating their statuses. Renders orders in a table with selectable status badges and persists changes via mutation hooks.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Admin UI to list organizations and create new ones, showing loading skeletons and organization metadata. Uses dialogs and query hooks to manage organization creation and display.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin UI for listing, creating, editing, and deleting products with category selection, pricing, stock, and SKU management, backed by product and category query hooks.",
  "frontend/src/components/crm/ContactManagement.tsx": "CRM interface to view, add, edit, and delete contacts, tied to the authenticated user and using dialogs and tables for CRUD operations.",
  "frontend/src/components/crm/LeadManagement.tsx": "CRM component for managing sales leads, including stage tracking, revenue estimates, contact linkage, and full CRUD actions.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "CRM module for managing sales opportunities with value, probability, stage, and notes, supporting create, update, and delete workflows.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Dashboard view summarizing the sales pipeline with lead stage distribution, progress bars, and aggregate counts for contacts, leads, and opportunities.",
  "frontend/src/components/Footer.tsx": "Presentational footer with copyright text, caffeine.ai attribution, and GitHub link.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, organization switching, admin/CRM/HRMS links, cart indicator, and routing.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder HRMS component displaying a card indicating that employee attendance tracking functionality is coming soon.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides a CRUD UI for departments, including listing, adding, editing, and deleting departments via query hooks, with dialogs, tables, and toast feedback.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Implements employee management with add/edit/delete dialogs, department selection, status badges, and integration with HR dashboard and department queries (employee list is currently simplified).",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Displays pending leave requests and allows approving or rejecting them using mutation hooks, with loading states and basic date formatting.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder component showing a payroll management card with a \"coming soon\" message and no functional logic.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder component for performance management that renders a static card indicating future functionality.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown component allowing authenticated users to switch between available organizations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting first-time authenticated users to create a basic user profile by entering their name.",
  "frontend/src/components/StripeSetupModal.tsx": "Modal that prompts admins to configure Stripe when it is not yet set up, collecting a secret key and allowed countries. Uses query hooks to check admin status, submit configuration, and show success/error toasts.",
  "frontend/src/components/WalletManagement.tsx": "Provides UI to list, add, and delete wallets, including wallet type, currency, and status display. Integrates with identity and wallet query hooks and shows results in a table with dialogs and toasts.",
  "frontend/src/components/WalletSummary.tsx": "Displays a summary of the user’s wallets, total balance, active wallet count, and recent transaction events. Handles loading states, status badges, and transaction formatting with auto-refetching.",
  "frontend/src/contexts/CartContext.tsx": "Defines a shopping cart context with localStorage persistence, supporting add/remove/update items, clearing the cart, and computing totals.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization state, fetching the user’s organizations (mocked), persisting selection in localStorage, and resetting on logout.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Provides wallet connection state and actions, handling provider availability detection, selection, connect/disconnect flows, and connected identity tracking.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query-based hook that creates and caches a backend actor tied to the current Internet Identity, initializing access control when authenticated and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider, managing login, logout, persisted identity loading, and detailed login status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a large collection of React Query hooks for fetching and mutating backend data (user profiles, organizations, ERP, wallet, CRM, orders), many of which depend on the actor and include placeholder implementations for unimplemented backend methods.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the useWalletConnector hook from the WalletConnectorContext for wallet connection and management.",
  "frontend/src/index.css": "Configures Tailwind CSS base, component, and utility layers along with extensive CSS variables for light and dark themes, including colors, layout tokens, and sidebar styling.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App within React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements the admin dashboard UI with analytics cards, access control based on admin status, loading skeletons, and tabbed management sections for products, orders, organizations, and wallets.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart and checkout flow, supporting Stripe and ICP wallet payments, handling authentication, wallet connection, order placement, and user feedback.",
  "frontend/src/pages/CrmDashboard.tsx": "Admin-only CRM dashboard page that fetches CRM stats and displays key metrics (contacts, leads, opportunities, revenue) along with tabbed management views for contacts, leads, opportunities, pipeline, and wallets.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin-only HRMS dashboard with tabbed navigation for overview and management of employees, departments, attendance, leaves, payroll, performance, and wallets, backed by aggregated HR metrics.",
  "frontend/src/pages/OrdersPage.tsx": "User-facing orders page that lists the current user's orders, shows status and details, allows order cancellation, and handles loading and empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple feedback page shown after a failed payment, offering navigation back to the cart or the storefront.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirmation page shown after a successful payment that clears the cart and provides navigation to orders or back to shopping.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog storefront that fetches products and categories, supports search and category filtering, and allows adding in-stock items to the cart.",
  "frontend/src/types/erp-types.ts": "Central TypeScript definitions for ERP domain models, including products, orders, CRM, HRMS, analytics, and related enums, acting as placeholders mirroring backend types.",
  "frontend/src/utils/formatIdentity.ts": "Utility function that shortens long identity strings (e.g., principals or account IDs) by truncating the middle for display.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash routing, persist them in sessionStorage, and clear sensitive hash parameters without page reloads.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements a WalletConnector for the Oisy wallet, handling availability detection, connect/disconnect flows, and retrieval of the connected principal via the inpage provider.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements a WalletConnector for the Plug wallet, supporting availability checks, user connection requests, principal/account ID retrieval, and connection state management.",
  "frontend/src/wallets/inpageProviders.d.ts": "Defines ambient TypeScript declarations for Plug and Oisy wallet inpage providers and extends the global window.ic interface.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors (Plug and Oisy) and exposes helper functions to list all connectors or fetch one by provider ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Declares shared wallet-related types and interfaces, including connector contracts, provider IDs, availability states, and connected identity info.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode support, content paths, custom theme extensions (colors, radius, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Captures high-level project metadata and current feature state for the CitizensCo UniversalERP, detailing architecture, authentication, wallet support, RBAC, and implementation progress."
}