{
  "backend/main.mo": "Defines the backend actor, integrating authorization and blob storage mixins, and declares all domain types for organizations, CRM, HRMS, ecommerce, and related entities.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs for deployment readiness UI and deployment checklist.",
  "frontend-file-summaries.txt": "Provides short descriptions of multiple frontend files, explaining their roles in UI, state management, routing, and admin features.",
  "frontend/ACTIVITY_2_DEPLOYMENT_CHECKLIST.md": "Step-by-step deployment checklist for Activity 2, including prerequisites, verification steps, migration notes, and common issues.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, theme styles, and global base styling for light and dark modes.",
  "frontend/index.html": "Base HTML page containing the root div and script loader for the frontend React application.",
  "frontend/src/App.tsx": "Main React application entry defining layout, routing, providers, and initialization flows including deployment readiness and setup modals.",
  "frontend/src/components/admin/CategoryManagement.tsx": "UI to list, create, edit, and delete product categories using dialog forms and query hooks.",
  "frontend/src/components/admin/OrderManagement.tsx": "Displays all orders in a table and allows updating order status with visual badges.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Lists organizations and provides a dialog form to create new ones with name and description.",
  "frontend/src/components/admin/ProductManagement.tsx": "Manages products including creation, editing, deletion, and category assignment via a dialog form.",
  "frontend/src/components/crm/ContactManagement.tsx": "CRUD interface for contacts with identity-based ownership and dialog-driven form editing.",
  "frontend/src/components/crm/LeadManagement.tsx": "Manages sales leads, including creation, stage updates, and linking to contacts using query hooks.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Provides UI and logic to list, create, edit, and delete CRM opportunities using dialog forms and query hooks.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays a sales pipeline dashboard with stage counts, progress bars, and summary metrics fetched from pipeline and lead queries.",
  "frontend/src/components/DeploymentReadinessBanner.tsx": "Admin-only banner displaying deployment readiness status with access control and Stripe configuration checks and recommended actions.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding, a heart icon, and a GitHub link.",
  "frontend/src/components/Header.tsx": "Provides the main navigation header with auth handling, org switching, admin links, and cart access.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder component showing a card for attendance tracking with no functional features yet.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Implements CRUD management for departments with dialogs, forms, and a table backed by department query hooks.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Handles adding, editing, and deleting employees with form dialogs and department selection, using HR dashboard and employee queries.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Displays pending leave requests with options to approve or reject them, using leave query mutations.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder card for payroll management with no implemented functionality yet.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder component for employee performance tracking, showing a coming-soon message.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown menu to view and switch between available organizations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for creating a basic user profile by submitting a name.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin‑only modal to configure Stripe by entering a secret key and allowed countries.",
  "frontend/src/components/WalletManagement.tsx": "UI for listing, adding, and deleting wallets with form inputs and status handling.",
  "frontend/src/components/WalletSummary.tsx": "Displays wallet balances and recent transactions with auto‑refresh behavior.",
  "frontend/src/contexts/CartContext.tsx": "Provides a cart context with item storage in localStorage and functions to add, remove, update, and clear cart items.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages the active organization based on user identity and localStorage, fetching organizations and syncing selection state.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Handles wallet connector availability, selection, connection state, and identity management for supported wallet providers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, persistence, and identity state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data including deployment readiness, user profiles, and various ERP entities.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from its context.",
  "frontend/src/index.css": "Sets up Tailwind and defines light and dark theme CSS variables for app styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing analytics metrics and management tabs, with access control and loading skeletons.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page handling item updates, Stripe or ICP checkout, wallet connection, and order placement.",
  "frontend/src/pages/CrmDashboard.tsx": "CRM dashboard for admins displaying CRM stats and management sections with access control and loading states.",
  "frontend/src/pages/HrmsDashboard.tsx": "HRMS dashboard providing employee, department, attendance, payroll, and performance management with admin‑only access.",
  "frontend/src/pages/OrdersPage.tsx": "User orders page listing past orders with status, details, and cancellation support.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Page displaying a payment failure message with navigation options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Page confirming successful payment, clearing the cart, and linking to orders or home.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog page with search, category filtering, loading skeletons, and add‑to‑cart handling.",
  "frontend/src/types/erp-types.ts": "Defines TypeScript types for products, categories, orders, CRM, HR, and analytics used across the app.",
  "frontend/src/utils/formatIdentity.ts": "Utility to shorten identity strings by truncating the middle.",
  "frontend/src/utils/urlParams.ts": "URL and session parameter utilities for reading, persisting, and clearing parameters.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Wallet connector implementing Oisy wallet availability checks, connection, disconnection, and state retrieval.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Wallet connector for Plug handling availability, connect flow, disconnect, and connection state.",
  "frontend/src/wallets/inpageProviders.d.ts": "Type declarations for Plug and Oisy in‑page wallet providers on the window object.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registry that instantiates and returns available wallet connectors by ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Shared wallet connector interfaces and types including provider IDs and identity info.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Defines the project’s overall state, listing major implemented ERP features including authentication, RBAC, user profiles, Stripe integration, and frontend/backend capability status. Serves as a structured inventory of existing functionality with versioned feature metadata."
}