{
  "backend/main.mo": "Defines the ERP backend actor with authorization, storage mixins, and comprehensive data types for orgs, CRM, HR, ecommerce, and operations.",
  "feature_evidence.json": "Feature evidence report linking a DeploymentReadinessBanner update to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing frontend components, hooks, pages, and styles.",
  "frontend/ACTIVITY_2_DEPLOYMENT_CHECKLIST.md": "Documentation for Activity 2 deployment steps with statuses, verification criteria, and migration notes.",
  "frontend/ACTIVITY_3_OPTION_1_SPEC_TEMPLATE.md": "Template for capturing requirements for Activity 3 Option 1 including goals, roles, UI, and backend needs.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/POST_MIGRATION_BUILD_NOTES.md": "Developer notes outlining verification steps for the post‑migration build process.",
  "frontend/src/App.tsx": "Main React app configuring routing, providers, readiness banner, modals, and page layout.",
  "frontend/src/components/admin/CategoryManagement.tsx": "CRUD interface for managing categories with a dialog form and table listing.",
  "frontend/src/components/admin/OrderManagement.tsx": "Shows all orders in a table and allows updating order status with colored badges.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Lists organizations and provides a dialog to create new ones with form validation.",
  "frontend/src/components/admin/ProductManagement.tsx": "Manages products with create/edit dialogs, category selection, and delete actions.",
  "frontend/src/components/crm/ContactManagement.tsx": "CRUD management for contacts, including identity-linked creation and a table view.",
  "frontend/src/components/crm/LeadManagement.tsx": "UI for viewing, creating, editing, and deleting CRM leads with stage tracking and form dialogs.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Manages opportunities including creation, editing, deletion, and stage/probability handling via form dialogs.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays pipeline metrics and lead distribution across stages with summary statistics.",
  "frontend/src/components/DeploymentReadinessBanner.tsx": "Displays an admin-only readiness banner showing deployment steps, statuses, and recommendations based on access control and Stripe setup.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, copyright, and a GitHub link.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with authentication controls, admin links, cart access, and organization switching.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder component showing upcoming attendance tracking features.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "CRUD interface for departments with a form dialog and table listing.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "CRUD management of employees including department assignment, salary, and status handling.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "UI for reviewing pending leave requests, allowing approval or rejection via query hooks with loading and empty states.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder payroll management card displaying a coming-soon message.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder performance management card showing a coming-soon message.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown component for selecting and switching between available organizations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their profile information.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe by submitting a secret key and allowed countries.",
  "frontend/src/components/WalletManagement.tsx": "Interface for viewing, adding, and deleting wallets for the selected organization, with dialogs and live updates.",
  "frontend/src/components/WalletSummary.tsx": "Displays organization wallet balances and recent transactions with auto-refresh, loading states, and error handling.",
  "frontend/src/contexts/CartContext.tsx": "Provides a cart context supporting item storage, quantity updates, localStorage persistence, and totals calculation.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages the active organization with localStorage persistence, validation against fetched orgs, and query invalidation on changes.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Handles wallet connector selection, availability checks, and connect/disconnect logic with state tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, identity loading, and status tracking using AuthClient.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook for localStorage-backed state with JSON serialization and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend interactions, including a deployment readiness check with access control and Stripe configuration status.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from its context.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/Activity3RequirementsPage.tsx": "UI for drafting and storing Activity 3 requirement specs, with clipboard and markdown export features.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing analytics, deployment readiness, and management components with access control checks.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page handling quantity updates, ICP or Stripe payment flows, and wallet connections.",
  "frontend/src/pages/CrmDashboard.tsx": "CRM dashboard for admins showing CRM stats and management tools with access control.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin-only HR dashboard providing overview metrics and tabbed management for employees, departments, attendance, leaves, payroll, performance, and wallets.",
  "frontend/src/pages/OrdersPage.tsx": "Displays a user’s order history with status badges, details, cancellation handling, and loading/empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to the cart or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart after successful payment and offers navigation to orders or the storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog with search, category filtering, product cards, loading states, and add‑to‑cart functionality.",
  "frontend/src/pages/WalletOverviewPage.tsx": "Shows organization wallet summaries with totals, loading/error states, and prompts when no organization is selected.",
  "frontend/src/types/erp-types.ts": "Defines TypeScript types for products, orders, CRM, HR, and ERP-related entities mirroring backend structures.",
  "frontend/src/utils/activity3BuildInstruction.ts": "Builds markdown instructions from an Activity 3 spec and checks if the spec is empty.",
  "frontend/src/utils/deploymentChecklistStepMessaging.ts": "Generates deployment step messaging based on access control and Stripe readiness.",
  "frontend/src/utils/formatIdentity.ts": "Formats identity strings by truncating their middle section.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/src/utils/walletErrors.ts": "Maps backend wallet-related errors to standardized user-facing messages.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements a wallet connector for Oisy, handling availability, connection, and state checks.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements a wallet connector for Plug, supporting connect, disconnect, and identity retrieval.",
  "frontend/src/wallets/inpageProviders.d.ts": "Defines TypeScript types for in-page wallet provider objects for Plug and Oisy.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and provides lookup functions.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines wallet connector interfaces, types, and connection state structures.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme settings, plugins, and custom animations.",
  "project_state.json": "Describes the project state, existing features, metadata, and configuration flags."
}