{
  "backend/main.mo": "Defines actor with authorization and storage mixins plus extensive type models for organizations, CRM, HRMS, ecommerce, and related entities.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files used for reference.",
  "frontend/index.css": "Tailwind setup defining OKLCH color variables for light and dark themes and applying base styles.",
  "frontend/index.html": "Basic HTML shell loading the SPA root and main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Main React app wiring routes, providers, authentication, and modals for profile and Stripe setup.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Supports CRUD operations for product categories through a dialog form and table listing.",
  "frontend/src/components/admin/OrderManagement.tsx": "Shows all orders in a table and allows updating each order’s status with visual status indicators.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Lists organizations and provides a form dialog to create new organizations with basic info.",
  "frontend/src/components/admin/ProductManagement.tsx": "UI for listing, creating, editing, and deleting products with form handling, dialogs, and CRUD hooks.",
  "frontend/src/components/crm/ContactManagement.tsx": "Manages contacts with creation, editing, deletion, and identity-linked ownership using CRUD hooks and dialogs.",
  "frontend/src/components/crm/LeadManagement.tsx": "Handles lead creation, editing, deletion, and stage tracking with contact linkage and CRM forms.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Provides CRUD management for opportunities, including value, stage, probability, and notes handling.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays pipeline statistics and lead distribution across stages with summary metrics and visual indicators.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, GitHub link, and simple layout.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication handling, organization switcher, and cart/admin shortcuts.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder component showing upcoming attendance tracking features within a simple card layout.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "UI for listing, adding, editing, and deleting departments using query hooks and a dialog form.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Component for managing employees with add, edit, delete dialogs and status handling, backed by HR dashboard data.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Displays pending leave requests and allows approving or rejecting them using query mutations.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder payroll UI card indicating payroll processing features are coming soon.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder performance management UI showing upcoming performance tracking features.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown allowing users to switch between available organizations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and create their profile.",
  "frontend/src/components/StripeSetupModal.tsx": "Shows a modal for admins to configure Stripe by submitting a secret key and allowed countries when Stripe is not yet set up.",
  "frontend/src/components/WalletManagement.tsx": "Provides UI to list, add, and delete user wallets, including form inputs and status displays.",
  "frontend/src/components/WalletSummary.tsx": "Displays a user’s wallet balances and recent transactions with auto-refresh and status indicators.",
  "frontend/src/contexts/CartContext.tsx": "Provides cart state with add, remove, quantity updates, persistence in localStorage, and total calculations.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization selection, persistence, and loading user organizations with fallbacks.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Context for managing wallet connector availability, selection, connection state, and connect/disconnect operations.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, organizations, orders, and other ERP-related entities using the backend actor.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from the WalletConnectorContext.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard UI showing analytics, management tabs, and access control based on admin status.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management and checkout flows for Stripe or ICP payments.",
  "frontend/src/pages/CrmDashboard.tsx": "Renders the CRM admin dashboard with stats, access control, and tabs for managing contacts, leads, opportunities, and pipeline.",
  "frontend/src/pages/HrmsDashboard.tsx": "Provides the HRMS admin dashboard with overview metrics and tabbed sections for employees, departments, attendance, leaves, payroll, and performance.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's orders with status badges, cancellation support, and loading or empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to the cart or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and displays a payment success confirmation with navigation options.",
  "frontend/src/pages/StorefrontPage.tsx": "Shows a searchable and filterable product catalog with category filtering and add‑to‑cart functionality.",
  "frontend/src/types/erp-types.ts": "Defines TypeScript types for ERP entities including products, orders, CRM records, HRMS data, and analytics.",
  "frontend/src/utils/formatIdentity.ts": "Formats identity strings by truncating the middle for cleaner display.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (query and hash), persist them in sessionStorage, and manage clearing stored or hash-based params.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements a wallet connector for Oisy, handling availability checks, connect/disconnect flow, and reporting connection state.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Defines a Plug wallet connector that manages install detection, connection requests, principal/account retrieval, and state checks.",
  "frontend/src/wallets/inpageProviders.d.ts": "Declares TypeScript interfaces for in‑page Plug and Oisy wallet providers exposed on window.ic.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors (Plug and Oisy) and exposes lookup utilities.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines wallet connector types, including provider IDs, identity info, and the WalletConnector interface.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, theming, animations, plugins, and content scanning rules.",
  "project_state.json": "Describes the project’s current state, versioning, and detailed feature inventory for the UniversalERP system."
}