{
  "backend/main.mo": "Defines the core ERP canister with authorization, storage mixins, and extensive domain types for organizations, ecommerce, CRM, HRMS, and tasks. Contains only type definitions and actor setup with no business logic shown.",
  "backend/migration.mo": "Provides wallet-related types and a migration module that currently applies an identity transform to the wallet domain state. Acts as a placeholder for future migration logic.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Text file listing summaries of various frontend files, covering components, pages, and contexts for the ERP web app.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-based light and dark theme color variables and applying global styles.",
  "frontend/index.html": "Basic HTML entrypoint that loads the root React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, theming, providers, and authentication-driven UI modals for the React app. Wraps pages with Layout and manages profile setup and Stripe configuration prompts.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin UI to list, add, edit, and delete product categories using dialog forms and query mutations.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin table for viewing orders and updating their statuses with formatted dates and real‑time mutation updates.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "UI for listing organizations, creating new ones via dialog, and viewing member details using query hooks.",
  "frontend/src/components/admin/ProductManagement.tsx": "Component for listing, creating, editing, and deleting products with category selection and form dialogs.",
  "frontend/src/components/crm/ContactManagement.tsx": "Manages contacts with create/edit dialogs, deletion, and identity-based ownership using query hooks.",
  "frontend/src/components/crm/LeadManagement.tsx": "Handles lead CRUD operations, including stage management, contact linking, and revenue input.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Provides UI for creating, editing, and deleting opportunities with stage, value, probability, and notes fields.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays a sales pipeline dashboard with stage counts, progress bars, and summary metrics using data from pipeline and leads queries.",
  "frontend/src/components/Footer.tsx": "Footer with copyright text, caffeine.ai attribution, and GitHub link.",
  "frontend/src/components/Header.tsx": "Header with authentication controls, navigation, organization switching, admin shortcuts, and cart item indicator.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Presents a placeholder card for future attendance tracking functionality.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides full CRUD management for departments with dialogs, forms, and table listings using department query hooks.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Implements employee CRUD management with dialogs, form handling, and status badges using HR and department data.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Shows pending leave requests in a table and allows approving or rejecting them with appropriate actions.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Displays a placeholder UI for upcoming payroll processing functionality.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Provides a placeholder card for future performance tracking features.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown menu allowing users to switch between organizations, showing names, descriptions, and the currently selected organization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and submits it to create a profile using a mutation with validation and toast feedback.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal that configures Stripe by submitting a secret key and allowed countries when Stripe is not yet set up.",
  "frontend/src/components/WalletManagement.tsx": "Interface for listing, adding, and deleting user wallets with form-driven creation, status display, and mutation-based CRUD operations.",
  "frontend/src/components/WalletSummary.tsx": "Displays a user's wallets, balances, and recent transactions with auto-refresh and status/type formatting.",
  "frontend/src/contexts/CartContext.tsx": "Implements a cart context with persistent storage, item management, quantity updates, and total calculations.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages the active organization state, loads organizations via query, and syncs selection with localStorage.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Provides React context for managing wallet connectors, tracking availability, selection, and connection state with methods to connect or disconnect.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, organizations, and various ERP entities using the backend actor.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from the context.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark theme design tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with analytics, management panels, and access control checks.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management, Stripe or ICP checkout, wallet handling, and order submission.",
  "frontend/src/pages/CrmDashboard.tsx": "Renders the admin‑only CRM dashboard showing contact, lead, and opportunity stats with management tabs.",
  "frontend/src/pages/HrmsDashboard.tsx": "Provides an admin‑only HRMS dashboard with overview metrics and tabs for employees, departments, attendance, payroll, and more.",
  "frontend/src/pages/OrdersPage.tsx": "Shows the user’s order history with status, details, cancellation support, and loading states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with navigation options back to cart or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and confirms successful payment with links to orders or shopping.",
  "frontend/src/pages/StorefrontPage.tsx": "Displays the product catalog with search, category filtering, product images, and add‑to‑cart functionality.",
  "frontend/src/types/erp-types.ts": "Defines placeholder ERP domain types for products, CRM, HR, and analytics mirroring backend structures.",
  "frontend/src/utils/formatIdentity.ts": "Utility to truncate and format identity strings for display.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Wallet connector implementing availability checks, connect, disconnect, and state queries for Oisy.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Wallet connector for Plug providing connect, disconnect, identity retrieval, and availability checks.",
  "frontend/src/wallets/inpageProviders.d.ts": "Ambient TypeScript declarations for Plug and Oisy in‑page wallet providers.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and provides lookup by provider ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines wallet connector interfaces, provider IDs, and identity info shape.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Describes current project state, schema versions, and feature set including authentication, RBAC, wallets, and org-scoped work."
}