{
  "backend/main.mo": "Defines the backend canister actor with access control, storage mixins, and extensive ERP/CRM/HRMS data type definitions.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to frontend files, components, and tests for verification.",
  "frontend-file-summaries.txt": "Provides short summaries of multiple frontend files including pages, components, hooks, and styles.",
  "frontend/ACTIVITY_2_DEPLOYMENT_CHECKLIST.md": "Deployment checklist detailing required steps, verification points, and readiness checks for Activity 2.",
  "frontend/ACTIVITY_3_OPTION_1_SPEC_TEMPLATE.md": "Template for specifying requirements and UI/Backend needs for Activity 3 Option 1.",
  "frontend/index.css": "Tailwind-based global styling with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML file bootstrapping the frontend and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Main React app configuring routing, providers, authentication handling, and layout including the new /wallets route.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Provides UI to list, create, edit, and delete product categories using dialog forms and query hooks.",
  "frontend/src/components/admin/OrderManagement.tsx": "Displays all orders with status, totals, and details, allowing inline status updates via a select control.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Lists organizations and provides a dialog form to create new ones with name and description.",
  "frontend/src/components/admin/ProductManagement.tsx": "Manages products including listing, adding, editing, and deleting, with fields for pricing, stock, category, and metadata.",
  "frontend/src/components/crm/ContactManagement.tsx": "Handles listing, creating, editing, and deleting contacts with identity-linked ownership and detailed contact fields.",
  "frontend/src/components/crm/LeadManagement.tsx": "Manages sales leads with creation, editing, stage updates, revenue estimates, and contact linkage.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Component for listing, creating, editing, and deleting sales opportunities with form handling and stage/probability management.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays pipeline metrics and lead distribution across stages using dashboard data and simple visual charts.",
  "frontend/src/components/DeploymentReadinessBanner.tsx": "Displays an admin-only readiness banner showing setup status for access control and Stripe, with recommendations if incomplete.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a GitHub link.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with authentication actions, admin links, cart/wallet/order access, and organization switching.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder UI for future attendance tracking with a simple card and message.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Full CRUD interface for departments including dialogs, forms, and table listing.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Component for creating, editing, and deleting employees, pulling department data and using a form dialog.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Displays pending leave requests and allows approving or rejecting them with action buttons.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder card indicating payroll processing features to be added later.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder component showing that performance tracking functionality is coming soon.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Dropdown for selecting the active organization, showing loading state and organization list.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save a basic profile with name input.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe with a secret key and allowed countries when not yet set up.",
  "frontend/src/components/WalletManagement.tsx": "Manages organization wallets, allowing creation, deletion, and listing with loading and error handling.",
  "frontend/src/components/WalletSummary.tsx": "Shows a summary of organization wallet balances and recent transactions, with auto-refresh and error states.",
  "frontend/src/contexts/CartContext.tsx": "Provides a cart context with item management, persistence in localStorage, and computed totals.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization selection, persistence, and query invalidation tied to user identity and org changes.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Handles wallet connector selection, availability checks, and connection lifecycle with stored state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity management via Internet Identity with login, logout, and persisted session handling.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing React state with localStorage using JSON serialization.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls into React Query hooks for deployment readiness, admin checks, Stripe config, and other domain data.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports wallet connector hook for convenience.",
  "frontend/src/index.css": "Tailwind setup defining CSS variables for light and dark themes across UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Activity3RequirementsPage.tsx": "Admin-only page for entering, storing, and generating build instructions for Activity 3 requirements with clipboard copy and draft management.",
  "frontend/src/pages/AdminDashboard.tsx": "Displays admin-only analytics and management tabs for products, categories, orders, organizations, and wallets.",
  "frontend/src/pages/CartPage.tsx": "Handles shopping cart checkout flow, supporting Stripe and ICP payments with wallet connection logic.",
  "frontend/src/pages/CrmDashboard.tsx": "Admin CRM dashboard showing contact, lead, and opportunity stats with management tabs.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin HRMS dashboard providing employee, department, attendance, payroll, and performance management views.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's orders with status, dates, and cancel actions, handling loading and empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message after unsuccessful payment with navigation options to cart or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart on load and displays a payment success confirmation with navigation options.",
  "frontend/src/pages/StorefrontPage.tsx": "Renders a product catalog with search, category filtering, loading states, and add-to-cart functionality.",
  "frontend/src/pages/WalletOverviewPage.tsx": "Displays wallet summaries for the selected organization with loading, error, and empty states, plus aggregated totals.",
  "frontend/src/types/erp-types.ts": "Defines TypeScript types for ERP entities such as products, orders, CRM objects, employees, and payroll.",
  "frontend/src/utils/formatIdentity.ts": "Utility to truncate identity strings by preserving prefix and suffix segments.",
  "frontend/src/utils/urlParams.ts": "Utilities for getting, storing, and clearing URL and session-based parameters, including hash-based routing support.",
  "frontend/src/utils/walletErrors.ts": "Normalizes various backend and authorization wallet errors into short, user-facing messages.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements the Oisy wallet connector with availability checks, connect/disconnect logic, and connection state retrieval.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements the Plug wallet connector handling installation checks, connect/disconnect flows, and identity retrieval.",
  "frontend/src/wallets/inpageProviders.d.ts": "Declares TypeScript ambient types for in-page Plug and Oisy wallet providers on window.ic.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and provides lookup utilities by connector ID.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines wallet connector interfaces, provider IDs, availability states, and identity info types.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with extended color system, themes, animations, and plugins.",
  "project_state.json": "Describes the current project state, feature progress, and requirements for implementing wallet-related frontend and backend features."
}