{
  "backend/main.mo": "Defines the ERP backend actor, including authorization mixins and all data types for organizations, CRM, HRMS, ecommerce, and storage.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests tied to deployment readiness verification for Activity 2 Step 6.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including pages, hooks, and components.",
  "frontend/ACTIVITY_2_DEPLOYMENT_CHECKLIST.md": "Markdown checklist detailing the full multi-step deployment process and readiness checks, including access control and Stripe configuration.",
  "frontend/ACTIVITY_3_OPTION_1_SPEC_TEMPLATE.md": "Specification template for defining requirements, roles, UI changes, and backend needs for Activity 3 Option 1.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables and theme styles for light and dark modes.",
  "frontend/index.html": "HTML entry point containing root mount element and script reference for the React application.",
  "frontend/POST_MIGRATION_BUILD_NOTES.md": "Developer notes for verifying the post-migration build during Activity 2 Step 5.",
  "frontend/src/App.tsx": "Main React app setup including routing, providers, modals, deployment readiness banner, and page registrations.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Provides CRUD UI for product categories with a dialog form for adding and editing categories.",
  "frontend/src/components/admin/OrderManagement.tsx": "Shows a table of orders and allows updating order status with color‑coded badges.",
  "frontend/src/components/admin/OrganizationManagement.tsx": "Lists organizations and provides a dialog to create new ones with loading states.",
  "frontend/src/components/admin/ProductManagement.tsx": "Manages product CRUD with a dialog form supporting pricing, categories, digital flag, and optional image handling.",
  "frontend/src/components/crm/ContactManagement.tsx": "Implements contact CRUD with identity-linked ownership and a modal form for editing.",
  "frontend/src/components/crm/LeadManagement.tsx": "Manages creation, editing, and deletion of CRM leads with dialogs, forms, and stage-based display. Integrates API hooks, identity, and UI components to handle lead lifecycle actions.",
  "frontend/src/components/crm/OpportunityManagement.tsx": "Handles CRUD operations for sales opportunities using forms and dialogs. Builds and submits opportunity data with stage, value, and probability fields.",
  "frontend/src/components/crm/PipelineOverview.tsx": "Displays pipeline statistics and lead counts per stage with visual progress bars. Fetches dashboard data and renders a summary and pipeline chart image.",
  "frontend/src/components/DeploymentReadinessBanner.tsx": "Displays an admin-only deployment readiness alert summarizing access control, Stripe setup, and recommendations with navigation to admin settings.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a GitHub link.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with authentication controls, admin links, cart access, and organization switching.",
  "frontend/src/components/hrms/AttendanceManagement.tsx": "Placeholder component showing an upcoming attendance tracking feature. Renders a simple card with icon and descriptive text.",
  "frontend/src/components/hrms/DepartmentManagement.tsx": "Provides CRUD management for departments using dialogs and forms. Loads department data and allows adding, editing, and deleting entries.",
  "frontend/src/components/hrms/EmployeeManagement.tsx": "Manages employees with forms for details such as role, department, salary, and status. Supports creating, editing, and deleting employees using API hooks.",
  "frontend/src/components/hrms/LeaveManagement.tsx": "Displays pending leave requests with approve and reject actions using query hooks and UI components.",
  "frontend/src/components/hrms/PayrollManagement.tsx": "Placeholder card showing upcoming payroll processing functionality.",
  "frontend/src/components/hrms/PerformanceManagement.tsx": "Placeholder card indicating future employee performance tracking features.",
  "frontend/src/components/OrganizationSwitcher.tsx": "Provides a dropdown to switch between available organizations, showing loading and active selection states.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal prompting new users to enter their name and create a profile via a mutation.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for entering Stripe credentials and allowed countries when Stripe is not yet configured.",
  "frontend/src/components/WalletManagement.tsx": "Manages organization wallets, including listing, adding, and deleting wallets with dialogs and API interactions.",
  "frontend/src/components/WalletSummary.tsx": "Displays organization wallet balances and recent transactions with loading, error, and no-organization states, using query hooks for data.",
  "frontend/src/contexts/CartContext.tsx": "Provides a cart context with add, remove, update, and persistence logic for product items.",
  "frontend/src/contexts/OrganizationContext.tsx": "Manages active organization state, syncing with localStorage and invalidating related queries on changes.",
  "frontend/src/contexts/WalletConnectorContext.tsx": "Tracks wallet connector availability, selection, and connection state with connect and disconnect handlers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and stored identity management.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs a state value to localStorage with JSON serialization.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks including deployment readiness checks using backend actor methods.",
  "frontend/src/hooks/useWalletConnector.ts": "Re-exports the wallet connector hook from its context.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Activity3RequirementsPage.tsx": "Admin-only page for entering and generating Activity 3 build instructions with local draft storage.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing analytics, configuration readiness, and management interfaces.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page handling Stripe or ICP checkout flows and wallet connections.",
  "frontend/src/pages/CrmDashboard.tsx": "Admin-only CRM dashboard displaying statistics and access to CRM management modules.",
  "frontend/src/pages/HrmsDashboard.tsx": "Admin‑gated HRMS dashboard with tabs for overview and management sections using HR data queries.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's orders with status, details, and cancellation support, including loading and empty states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart and shows a success message with navigation to orders or storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Product catalog with search, category filtering, loading skeletons, and add‑to‑cart functionality.",
  "frontend/src/pages/WalletOverviewPage.tsx": "Displays wallet summaries for the active organization with loading and error states.",
  "frontend/src/types/erp-types.ts": "Type definitions for ERP entities including products, orders, CRM objects, HRMS structures, and supporting enums.",
  "frontend/src/utils/activity3BuildInstruction.ts": "Generates Markdown build instructions from an Activity 3 spec and checks if the spec is empty.",
  "frontend/src/utils/formatIdentity.ts": "Formats identity strings by truncating the middle for display.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash routing support.",
  "frontend/src/utils/walletErrors.ts": "Converts backend wallet-related errors into standardized user-facing messages.",
  "frontend/src/wallets/connectors/oisyConnector.ts": "Implements a wallet connector for Oisy, handling availability, connect, disconnect, and state retrieval.",
  "frontend/src/wallets/connectors/plugConnector.ts": "Implements a wallet connector for Plug, including connect flows, identity retrieval, and disconnect handling.",
  "frontend/src/wallets/inpageProviders.d.ts": "Declares TypeScript ambient types for Plug and Oisy in‑page wallet providers.",
  "frontend/src/wallets/walletConnectorRegistry.ts": "Registers available wallet connectors and exposes lookup utilities.",
  "frontend/src/wallets/walletConnectorTypes.ts": "Defines shared wallet connector interfaces, IDs, and identity types.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with extended theming, plugins, colors, animations, and container settings.",
  "project_state.json": "Stores project metadata, versioning, and a single existing feature definition."
}