{
  "kind": "build_request",
  "title": "Activity 2 Next Step: Implement wallet-domain upgrade migration plumbing (preupgrade/postupgrade + migration.run)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix and complete canister upgrade lifecycle plumbing in `backend/main.mo` so wallet-domain state is safely persisted across upgrades and routed through `Migration.run(...)` during `system func postupgrade()`, while keeping all existing public APIs and method signatures backward-compatible (RBAC, user profiles, organization, Stripe, and existing wallet query methods).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes to next step of Activity 2"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` compiles without unresolved references (e.g., `Migration` is properly imported/defined).",
        "On upgrade, the canister calls `Migration.run({ wallets; walletTransactions; walletEvents })` and assigns the returned state back to the stable vars.",
        "All existing public methods keep the same names and signatures as before this change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add or update `backend/migration.mo` to export a stable `run(...)` entrypoint that accepts the pre-upgrade wallet-domain state `{ wallets; walletTransactions; walletEvents }` and returns the post-migration wallet-domain state in a forward-compatible structure suitable for later Activity 2 organization-scoping steps.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes to next step of Activity 2"
        ]
      },
      "acceptanceCriteria": [
        "`backend/migration.mo` exists and can be imported from `backend/main.mo`.",
        "`Migration.run(...)` is a pure migration function that returns a complete wallet-domain state object containing `wallets`, `walletTransactions`, and `walletEvents`.",
        "A no-op migration path is supported (i.e., an upgrade where no structural changes are needed keeps existing wallet data intact)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor architecture with all Motoko logic in `backend/main.mo` (aside from the dedicated migration module in `backend/migration.mo`).",
    "Generate/modify `backend/migration.mo` only as needed for upgrading existing stable state (conditional migration policy).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement additional wallet CRUD/list APIs or frontend wiring as part of this step.",
    "Do not change UI styling or introduce new UI features in this step.",
    "Do not introduce new backend services, external databases, or non-Motoko backend code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}