{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 1: Wallet Overview (frontend only)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create a Wallet Overview Page that reads the active organization from OrganizationContext and loads organization-scoped wallet overview data via React Query with clear loading/empty/error states.",
      "acceptanceCriteria": [
        "When no organization is selected, the page shows an inline prompt telling the user to select an organization.",
        "When an organization is selected, the page fetches and displays the wallet overview information for that organization only.",
        "The page shows a loading skeleton/spinner while fetching and a user-friendly error message on failure.",
        "If the organization has no wallets, the page shows an empty state indicating no wallets were found."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WalletOverviewPage.tsx",
          "operation": "create",
          "description": "Implement the Wallet Overview Page UI. Read activeOrganization from OrganizationContext; when missing, render an inline prompt. When present, fetch overview metrics using React Query hooks (org-scoped). Render loading (skeleton/spinner), empty (no wallets), and error states (including authorization errors normalized to English)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/extend wallet read hooks needed by the Wallet Overview experience to call existing backend actor methods (e.g., organization-scoped wallet list, single wallet fetch by id, and organization-scoped wallet overview summary). Ensure query keys include organizationId (and walletId where relevant) and normalize errors with normalizeWalletError for user-friendly messages."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add routing and navigation entry points for the Wallet Overview Page and ensure organization switching updates cached queries by scoping keys with organization id.",
      "acceptanceCriteria": [
        "A new route exists for the Wallet Overview Page and is reachable via in-app navigation.",
        "Switching the active organization updates the Wallet Overview data (query keys include organization id so caches are correctly separated).",
        "No edits are made to any frontend immutable paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new tanstack router route for the Wallet Overview Page and add it to the route tree so it is navigable within the app."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add an in-app navigation control (e.g., a header button/link) that routes to the new Wallet Overview Page for authenticated users."
        }
      ]
    }
  ]
}