{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend deployment readiness status UI and Activity 2 deployment checklist",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Expose backend deployment/readiness status in the UI with clear English messages and recommended next actions (access control + Stripe at minimum).",
      "acceptanceCriteria": [
        "The app shows a clear status panel/banner when critical prerequisites are not met (at minimum: access control not initialized; Stripe not configured).",
        "User-facing text is in English.",
        "The UI does not require editing any files under frontend/src/components/ui or other immutable paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the generated backend TypeScript declarations to include the new structured readiness status type and the single backend method used to query readiness (as added by REQ-2), so the frontend can call it without type errors."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook (e.g., useDeploymentReadiness) that calls the backend readiness method via the actor, returns a structured readiness result, and never throws uncaught errors (surface failures as a safe UI state/message instead)."
        },
        {
          "path": "frontend/src/components/DeploymentReadinessBanner.tsx",
          "operation": "create",
          "description": "Create a non-intrusive status banner/panel component that consumes the readiness hook and renders English, user-facing diagnostics and next-action guidance (e.g., access control initialization required; Stripe configuration required). Ensure it does not depend on or modify any files under frontend/src/components/ui (immutable paths)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new DeploymentReadinessBanner into the main app layout so it is visible after deploy (e.g., within Layout above the Outlet) and is not an orphan component."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add an Activity 2 step-by-step deployment checklist document to the repo (English), including readiness verification guidance before publish.",
      "acceptanceCriteria": [
        "A new documentation file exists in the repository describing the numbered Activity 2 steps (including Step 6 deploy, Step 7 publish) and what to verify before continuing.",
        "The checklist includes a specific instruction to verify the new readiness status before attempting publish.",
        "All user-facing/document text is English."
      ],
      "file_operations": [
        {
          "path": "frontend/ACTIVITY_2_DEPLOYMENT_CHECKLIST.md",
          "operation": "create",
          "description": "Add an English, numbered “Activity 2 deployment checklist” documenting the confirm-at-each-step workflow, including Step 6 deploy and Step 7 publish, explicitly warning against mid-step manual changes and instructing operators to verify the new readiness status in the app UI before attempting publish."
        }
      ]
    }
  ]
}