{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 9,
  "summary": "CitizensCo UniversalERP remains a React (Vite) SPA backed by an ICP Motoko canister with Internet Identity auth, server-enforced RBAC, Stripe checkout via IC HTTP outcalls, and in-browser ICP wallet connectors. Scope has expanded to true multi-tenant (multi-organization) support: Phase 1 (organization creation + org-scoped memberships/users) has been initiated/implemented, and work is now progressing toward org-scoping wallets/transactions/events so all ERP modules can be safely isolated per organization. Wallet connectivity is being extended to support both Oisy (default) and Plug, with planned per-organization default-wallet configuration; additional alternative payment methods beyond Stripe are also planned.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "DelegationIdentity session"
      ],
      "description": "Implements an InternetIdentityProvider/useInternetIdentity hook using @dfinity/auth-client to initialize/restore identities, perform login/logout, and expose login lifecycle status flags and error state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-aware canister actor creation with access-control initialization",
      "synonyms": [
        "useActor",
        "authenticated actor recreation",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Creates an anonymous canister actor when unauthenticated and an authenticated actor when logged in; on authenticated actor creation it calls the backend access-control initializer using a secret token extracted from the URL hash/session.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secure secret extraction from URL hash with session persistence",
      "synonyms": [
        "getSecretParameter",
        "getSecretFromHash",
        "sessionStorage token persistence"
      ],
      "description": "Utility functions extract secrets from the URL hash fragment (preferred over query params), store them in sessionStorage, and attempt to remove them from the URL to reduce leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Backend role-based access control (RBAC)",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "admin/user/guest roles",
        "isCallerAdmin"
      ],
      "description": "Motoko access-control module assigns roles (first caller can become admin using a shared token), supports admin-only role assignment, and exposes role/admin query methods used to gate admin UIs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile storage with onboarding modal",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "ProfileSetupModal"
      ],
      "description": "Backend stores per-caller user profiles and enforces user-role permission checks. Frontend prompts authenticated users without a profile to create one via a blocking setup modal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Stripe configuration and Checkout Session creation",
      "synonyms": [
        "isStripeConfigured",
        "setStripeConfiguration",
        "createCheckoutSession",
        "StripeSetupModal"
      ],
      "description": "Admin-only Stripe configuration is stored in the canister; the canister can create Stripe Checkout sessions via HTTP outcalls. Frontend shows an admin-only setup modal when Stripe is not configured and uses createCheckoutSession during checkout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "IC HTTP outcalls helper with response transform",
      "synonyms": [
        "OutCall.httpGetRequest",
        "OutCall.httpPostRequest",
        "transform strips headers"
      ],
      "description": "Motoko helper wraps IC.http_request for GET/POST with cycle budgeting, default headers (User-Agent and Idempotency-Key for POST), a transform function that removes headers, and UTF-8 decoding with traps on empty responses.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Blob-storage gateway authorization and dead-blob pruning utilities",
      "synonyms": [
        "caffeine storage mixin",
        "gateway principal sync",
        "dead blob pruning",
        "cashier refill"
      ],
      "description": "Motoko storage modules/mixin support updating authorized gateway principals from a cashier canister, listing/pruning dead blobs with authorization checks, and topping up cycles via a cashier interface; includes a certificate creation stub.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Shopping cart state with localStorage persistence",
      "synonyms": [
        "CartProvider",
        "add/remove/update quantity",
        "computed totals"
      ],
      "description": "Cart context persists cart items to localStorage, supports addItem/removeItem/updateQuantity/clearCart, and computes totalItems/totalPrice used across the storefront and checkout UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Storefront product catalog UI (scaffolded data)",
      "synonyms": [
        "StorefrontPage",
        "product grid",
        "search + category filter"
      ],
      "description": "Implements a product catalog page with search and category filtering, product cards, stock-aware add-to-cart handling, and loading/empty states (currently backed by stubbed product/category query hooks).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Cart checkout flow with Stripe and ICP wallet gating",
      "synonyms": [
        "CartPage",
        "Stripe redirect checkout",
        "ICP wallet checkout option"
      ],
      "description": "Checkout supports Stripe (creates a checkout session and redirects to Stripe) and an ICP-wallet option that is gated on a connected wallet provider; includes success/failure result pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Orders UI (customer + admin) scaffolding",
      "synonyms": [
        "OrdersPage",
        "OrderManagement",
        "cancel/update status"
      ],
      "description": "Customer order history UI with status badges and cancel action, plus an admin order management table with status editing. Underlying data operations are currently mocked/stubbed in query hooks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Admin-gated dashboards and navigation",
      "synonyms": [
        "AdminDashboard",
        "CrmDashboard",
        "HrmsDashboard",
        "access denied screens"
      ],
      "description": "Admin-only pages and navigation are gated via isCallerAdmin; dashboards include KPI cards and tabbed management areas for ecommerce admin, CRM, HRMS, and wallets.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "CRM dashboard and management UIs (scaffold)",
      "synonyms": [
        "ContactManagement",
        "LeadManagement",
        "OpportunityManagement",
        "PipelineOverview"
      ],
      "description": "Implements CRM UI for managing contacts/leads/opportunities with dialogs, tables, stage badges, pipeline summaries, and conversion calculations; backend integrations for CRUD/list are not implemented (hooks throw/return empty).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "HRMS dashboard and management UIs (partial scaffold)",
      "synonyms": [
        "EmployeeManagement",
        "DepartmentManagement",
        "LeaveManagement",
        "attendance/payroll/performance placeholders"
      ],
      "description": "Implements HRMS dashboard tabs and KPI cards; includes department and leave-management UIs, while attendance/payroll/performance are “coming soon” placeholders and most mutations are not implemented in the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Wallet connector framework (Oisy and Plug)",
      "synonyms": [
        "WalletConnectorProvider",
        "PlugConnector",
        "OisyConnector",
        "auto-select Oisy"
      ],
      "description": "Connector abstraction over in-page wallet providers supports availability detection, provider selection, connect/disconnect, and connection-state checks; defaults to Oisy when available, otherwise Plug.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Wallet summary and wallet management UIs (scaffolded data)",
      "synonyms": [
        "WalletSummary",
        "WalletManagement",
        "transactions/events polling"
      ],
      "description": "UI components display wallet balances/statuses and recent transaction events with polling/refetch patterns and wallet CRUD UI; underlying wallet/transaction hooks are mocked or throw “not implemented”.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Organization selection context and switcher UI (scaffold)",
      "synonyms": [
        "OrganizationProvider",
        "OrganizationSwitcher",
        "active organization persistence"
      ],
      "description": "Frontend maintains an active organization with localStorage persistence and provides a header dropdown switcher; organization list/create/member APIs are currently mocked/unimplemented in hooks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Identity formatting helper",
      "synonyms": [
        "formatIdentity",
        "principal truncation",
        "account id shortening"
      ],
      "description": "Utility to truncate long identity strings for display (prefix...suffix), used in wallet connection UI and other identity displays.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Canister upgrade migration scaffolding",
      "synonyms": [
        "migration.mo",
        "preupgrade/postupgrade",
        "stable state migration"
      ],
      "description": "Adds explicit canister migration hooks/scaffolding to support state persistence and evolution across canister upgrades (e.g., preupgrade/postupgrade wiring and migration module organization).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Reusable build template for ICP + React (Vite) stack",
      "synonyms": [
        "build-template",
        "deploy.sh",
        "icp.yaml",
        "template workspace"
      ],
      "description": "Provides a build-template workspace (frontend/backend configs, scripts, and dependencies) to bootstrap, build, and deploy the UniversalERP stack in a repeatable way.",
      "reqIds": [],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement true multi-organization (multi-tenant) support: organizations, memberships, org-scoped roles, and admin management UI (Phase 1 foundation).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Make wallets/transactions/events organization-scoped (tenant isolation), including backend storage + migration/compatibility + frontend wiring to active organization and UI updates (phased micro-steps).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-3",
      "summary": "Support multiple wallet connectors including Oisy and Plug, with Oisy as default.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-4",
      "summary": "Allow admins to configure/select the default wallet connector per organization.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Enable real transaction tracking and live wallet balance updates across dashboards (permission-aware).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-6",
      "summary": "Add two additional alternative payment methods beyond Stripe (e.g., ICP native payments and manual/bank transfer) with documented strengths/weaknesses and unified transaction handling.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Create a new Motoko module at `backend/migration.mo` that exports a `run(...)` entrypoint for canister upgrade migrations, structured specifically to migrate legacy (pre-organization-scoped) wallet-domain state into the current organization-scoped wallet-domain structures; the initial implementation may be a no-op/pass-through but must compile and keep its public API stable for future Activity 2 steps.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Wire the Activity 2 migration scaffold into `backend/main.mo` canister upgrade lifecycle by adding minimal stable upgrade plumbing that (a) persists the wallet-domain state across upgrades, (b) passes the pre-upgrade (legacy) wallet-domain state into `migration.run(...)` during upgrade, and (c) persists the post-migration organization-scoped wallet-domain state after upgrade, without breaking existing canister behavior or changing existing public APIs unrelated to the migration.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend uses TanStack Router for routing and @tanstack/react-query for data fetching, caching, polling (refetchInterval), and mutation invalidation.",
    "Provider-driven app composition: InternetIdentityProvider, ThemeProvider (next-themes), QueryClientProvider, CartProvider, OrganizationProvider, and WalletConnectorProvider wrap the app.",
    "Identity-aware backend actor creation: useActor recreates an authenticated actor when II identity changes and invalidates/refetches dependent React Query caches.",
    "Backend is a Motoko actor composed via mixins (authorization + blob-storage maintenance), with centralized type definitions in backend/main.mo.",
    "Server-side RBAC is enforced via AccessControl (admin/user/guest) and exposed to the frontend through isCallerAdmin for UI gating.",
    "Stripe integration is implemented in Motoko using IC management canister HTTP outcalls with a response transform that strips headers.",
    "Wallet connectivity is handled entirely in-browser using a connector abstraction over window.ic providers (Oisy/Plug) with auto-selection preferring Oisy.",
    "BigInt is used throughout for money and timestamps (nanoseconds) with frequent UI conversion to Number for display.",
    "UI is built with Tailwind CSS (OKLCH variable palette) and shadcn/ui-style primitives (Card, Tabs, Dialog, Table, etc.).",
    "Most ERP modules beyond auth/profile/Stripe are currently implemented as UI scaffolds with stable query keys and planned invalidation patterns, but missing backend implementations."
  ],
  "known_issues": [
    "Most React Query hooks in frontend/src/hooks/useQueries.ts are placeholders (returning empty arrays/null, disabled queries, or throwing “Backend method not yet implemented”), causing many UI actions to fail at runtime.",
    "Backend implements only a small subset of the declared ERP domain APIs (notably RBAC initialization/queries, user profile get/save, getOrganization, and Stripe methods); list/create/update/delete flows for most modules are missing.",
    "Access control initialization depends on the CAFFEINE_ADMIN_TOKEN environment variable; missing configuration will trap during _initializeAccessControlWithSecret.",
    "AccessControl.getUserRole traps with “User is not registered” for authenticated callers if initialization does not register them, potentially breaking authenticated flows.",
    "Stripe request body builder writes shipping_address_collection[allowed_countries][0] for every country, likely overwriting entries and effectively sending only one allowed country.",
    "Stripe urlEncode is incomplete (only replaces space/&/=), which may generate invalid x-www-form-urlencoded bodies for other reserved characters.",
    "Wallet balances/amounts are converted from bigint to JS Number in multiple UI components, risking precision loss for large values.",
    "OrganizationProvider/useListOrganizations are mocked to return [], so organization switching and org-scoped views cannot function end-to-end.",
    "There are two Tailwind variable files (frontend/index.css and frontend/src/index.css) with different palettes, creating ambiguity about which theme variables are intended.",
    "Multi-organization is not yet fully end-to-end: org-scoped tenant isolation is incomplete until wallets/transactions/events (and later ERP domain entities) are scoped and enforced per organization."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "CitizensCo UniversalERP",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}